Revit 2027 API
ParameterTypeId.DimIsreporting Property
 "Is Reporting"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DimIsreporting { get; }
Public Shared ReadOnly Property DimIsreporting As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DimIsreporting {
	ForgeTypeId^ get ();
}
static member DimIsreporting : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace